src/client-app/packages/bmftech/src/Http/Controllers/Web/FeedController.php

    public function index(): Response
    {
        $title = $this->config->where('name', 'title')->first()->value;
        $subTitle = $this->config->where('name', 'sub_title')->first()->value;
        $updatedAt = $this->post->latest()->first()->updated_at->toAtomString();
        $posts = $this->post->whereNotNull('published_at')->get();
---
select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc limit 1