src/client-app/packages/bmftech/src/Http/Controllers/Web/HomeController.php

    public function index(): View
    {
        $recentPosts = $this->postRepository->findPublished(self::PAGINATION_LIMIT);
        $randomPosts = $this->postRepository->findByRandom(self::PAGINATION_LIMIT);
        $categories = $this->categoryModel->all();
        $tags = $this->tagModel->all();
---
select * from `tags` where `tags`.`deleted_at` is null