src/client-app/packages/bmftech/src/Helpers/common.php

    function get_the_blog_info(String $info)
    {
        $config = Config::where('name', $info)->firstOrFail();
---
select * from `configs` where `name` = 'title' and `configs`.`deleted_at` is null limit 1