src/core-app/app/Repositories/Eloquent/CategoryRepository.php

select * from `categories` where `categories`.`deleted_at` is null order by `created_at` desc
---
    public function findAll(): Collection
    {
        // TODO Remove a orderBy method after implementation of search api.
        return $this->categoryModel->orderBy('created_at', 'desc')->get();