src/core-app/app/Repositories/Eloquent/ConfigRepository.php

select * from `configs` where `name` = 'title' and `configs`.`deleted_at` is null limit 1
---
    public function findByName(string $name): Config
    {
        return $this->configModel->where('name', $name)->firstOrFail();