src/core-app/app/Repositories/Eloquent/PostRepository.php

    public function findByRandom(int $paginationLimit = null)
    {
        $posts = $this->postModel->where('publication_status', self::PUBLICATION_STATUS_PUBLIC)->inRandomOrder()->orderBy('created_at', 'desc');

        if ($paginationLimit) {
            return $posts->paginate($paginationLimit);
---
select * from `posts` where `publication_status` = 'public' and `posts`.`deleted_at` is null order by RAND(), `created_at` desc limit 10 offset 0
select count(*) as aggregate from `posts` where `publication_status` = 'public' and `posts`.`deleted_at` is null