src/core-app/app/Repositories/Eloquent/PostRepository.php

    public function findAll(int $paginationLimit = null)
    {
        $posts = $this->postModel->orderBy('created_at', 'desc');

        if ($paginationLimit) {
            return $posts->paginate($paginationLimit);
        }

        return $posts->get();
---
select count(*) as aggregate from `posts` where `posts`.`deleted_at` is null
select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc limit 20 offset 0

    public function findAllByCategoryName(string $name, int $paginationLimit = null)
    {
        $posts = $this->categoryModel->where('name', $name)->firstOrFail()->posts()->where('publication_status', 'public');

        if ($paginationLimit) {
            return $posts->paginate($paginationLimit);
        }

        return $posts->get();
---
select * from `categories` where `name` = 'category-8' and `categories`.`deleted_at` is null limit 1
select * from `posts` where `posts`.`category_id` = '2' and `posts`.`category_id` is not null and `publication_status` = 'public' and `posts`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `posts` where `posts`.`category_id` = '2' and `posts`.`category_id` is not null and `publication_status` = 'public' and `posts`.`deleted_at` is null
select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc limit 1