src/core-app/app/Repositories/Eloquent/TagRepository.php

    public function findAll(): Collection
    {
        // TODO Remove a orderBy method after implementation of search api.
        $tags = $this->tagModel->orderBy('created_at', 'desc')->get();
---
select * from `tags` where `tags`.`deleted_at` is null order by `created_at` desc